[
    {
        "id": 1,
        "heading": "Tyler Mingst",
        "role":"Chairman",
        "detail": "Tyler is Chairman and a member of the Investment Advisory Committee. Tyler is involved in the weekly investing vetting process as well as sourcing. He is a permanent member of the Investment and Valuation Committees and a senior resource providing overarching guidance across both the Investment and Asset management teams. Tyler also plays an active role with LP relationships.Tyler has 23 years of distressed credit and real estate due diligence, investment, and restructuring experience, and has spent 15 years underwriting, acquiring and managing assets in eight Asian and European countries, including his most recent position as partner and co-founder of Apollo Management’s European distressed loan business based in London. From 2007 through 2013, he co-led loan portfolio acquisition, financing and sale transactions with an investment value of nearly U.S.$2 billion across multiple European jurisdictions for Apollo’s European Principal Finance Funds I and II. Between 2005 and 2007, Tyler was co-head of the London-based European Special Situations Portfolio team for Credit Suisse. Before Credit Suisse, he was a Senior Manager in Ernst & Young’s global distressed real estate advisory business, where he ran acquisition due diligence assignments for institutional investors of real estate-backed loan portfolios in Germany, China, Hong Kong, Thailand and Taiwan. Tyler began his career at Kenneth Leventhal & Co. in Los Angeles.Tyler received his BA degree in Liberal Arts from Colorado College in 1990 and his dual MBA and Master of Architecture degrees from UCLA in 1994",
        "img": "../../assets/img/team/Mingst, Tyler.jpg"
    },
    {
        "id": 2,
        "heading": "Simon Finn ",
        "role":"Managing Partner",
        "detail": "Simon is the Managing Partner, a member of the Investment Advisory Committee.Simon has over 18 years of professional experience across banking, distressed and opportunistic credit and real estate and restricting experience. He has extensive knowledge in structuring and due diligence, investing throughout the capital structure across multiple jurisdictions and asset classes, most recently as a Senior Portfolio Manager at CQS having joined in 2014. Prior to CQS, Simon was a Managing Director at Apollo Global Management, having joined in 2008 and was a co-head of the investment team for the European Principal Finance Fund I. He was responsible for origination, investment underwriting and post-acquisition management across the full range of performing and non-performing asset classes. Prior to Apollo Management, he was employed by Hudson Advisors Germany, the captive distressed platform of Lone Star Funds, where he served as Vice President and Head of European Underwriting. In this role, Simon was responsible for screening, executions and closing distressed investments and real estate opportunities for the Lone Star Fund across all European markets. Prior to that, he was based in Australia at the National Australia Bank Group, most recently as a Senior Finance Partner.Simon holds a Bachelor of Commerce with a Major in Applied Finance from Deakin University, Melbourne, Australia.",
        "img": "../../assets/img/team/Finn, Simon.jpg"
    },
    {
        "id": 3,
        "heading": "David White",
        "role":"Partner",
        "detail": "David is a Partner and member of the Investment Advisory Committee.David has 14 years of real estate, distressed credit, opportunistic credit, investment, and restructuring experience. He has extensive knowledge in structuring and due diligence, investing throughout the capital structure across multiple jurisdictions and asset classes. Most recently from 2013 to 2019 he was a Partner of Tyndaris Real Estate based in London where he helped build a business predominantly focused on real estate opportunistic credit with a European focus and EUR 1.6 billion of assets under management. During this time, he invested in senior and mezzanine loans, preferred equity positions and structured equity joint ventures, and also sat on the investment committee, and oversaw all aspects of reporting, asset management workout and restructuring efforts. From 2007 through to 2013, David worked within the Deutsche Bank Special Situations Group where he focused on direct lending, distressed investing and purchasing NPLs, based in London, Hong Kong and New York.David graduated from Brandeis University with degrees in Economics, East Asian Studies and Business.",
        "img": "../../assets/img/team/White, David.jpg"
    },
    {
        "id": 4,
        "heading": "Tom Saunders",
        "role":"Head of Post-Acquisition",
        "detail": "Tom Saunders is Intriva’s Head of Asset Management and a member of the Investment Advisory Committee.Tom bears ultimate responsibility for the successful execution of the business plan for each asset owned by the Fund. Tom has approximately 28 years’ experience, serving recently as the Head of Non-Core for a global commercial bank, where he was directly responsible for a team of senior professionals overseeing restructuring, work-out, development and value-add/opportunistic investment properties covering retail, office, industrial and residential sectors across both debt and equity capital investments. It was during this time that he worked closely, albeit on opposing sides, with Intriva’s Partners as a co-creditor on a large and complex cross border restructuring during the global financial crisis.",
        "img": "../../assets/img/team/Saunders, Tom.jpg"
    },
    {
        "id": 5,
        "heading": "Dean Walsh",
        "role":"Chief Financial Officer",
        "detail": "Dean is the CFO of Intriva and is responsible for all aspects of finance, taxation and compliance within Intriva’s operations, including advice to the Manager on the development and oversight of the investment structures used by the Fund and all investor reporting. Before joining Intriva, Dean was a Director at Grant Thornton, where he joined in 2003. During his time at Grant Thornton, Dean focused on providing restructuring and insolvency advice to directors, lenders, Regulators and other key stakeholders in situations where companies are experiencing financial stress or there are concerns regarding sustainability or viability of a company. During this time, Dean utilised his accounting and financial reporting experience developed when assessing accounting policies and procedures, reviewing all accounting functions, testing of transactions, audit and review of controls, and the preparation of Financial Statements.Dean is a qualified Chartered Accountant and has a Certificate in Insolvency in the United Kingdom.",
        "img": "../../assets/img/team/Walsh, Dean.jpg"
    },
    {
        "id": 6,
        "heading": "Rosanna Phillips",
        "role":"General Counsel",
        "detail": "Rosanna is the General Counsel of Intriva and is responsible for overseeing legal matters in relation to the business including  legal advice, risk evaluation, structuring and execution.  Before joining Intriva, Rosanna spent over 10 years at Linklaters LLP in London and New York focusing on banking and finance transactions.  Rosanna has extensive experience advising on the structuring, preparation and negotiation of a wide range of commercial documentation for creditors (throughout the capital structure and with a particular focus on highly structured transactions) and debtors on domestic and cross border transactions across a range of asset classes.  Whilst at Linklaters, Rosanna spent almost a year on secondment at LaSalle Investment Management on their Debt Investments and Special Situations desk, assisting the team on all aspects of transactions.Rosanna has a law degree from Cambridge University and is admitted as a Solicitor in England & Wales",
        "img": "../../assets/img/team/Phillips, Rosanna.jpg"
    },
    {
        "id":7 ,
        "heading": "Raphael Söhngen",
        "role":"Principal",
        "detail": "Raphael joined Intriva in June 2018 as a Principal within the investment team and has over 13 years’ experience in distressed asset backed investing. Prior to joining Intriva, Raphael was a Vice President at HPS Investment Partners, which he joined in 2017 and where he focused on investments in European lease and loan portfolios backed by assets and receivables. Prior to this Raphael served 10 years at Fortress Investment Group most recently as Vice President in the Private Equity business where he focused on investments across Germany, Italy and the UK in distressed and performing real estate assets, real estate backed loans, public and private real estate backed companies and closed-end real estate funds. Responsibilities included the screening, underwriting and execution of investment opportunities as well as post-acquisition management, restructuring and disposal of existing investments. Raphael began his career as Analyst at Archon Group Germany, focusing on the asset management and work-out of commercial and industrial assets of real estate and NPL-portfolios.Raphael received his Master in Business Administration from Ludwig-Maximilian University in Munich with majors in strategic management, international markets & location research as well as risk and insurance. Raphael speaks both German and English.",
        "img": "../../assets/img/team/Söhngen, Raphael.jpg"
    },
    {
        "id": 8,
        "heading": "Andrea Rumignani",
        "role":"Associate",
        "detail": "Andrea joined Intriva in April 2018. Prior to joining, Andrea worked for nearly four years as an Associate at Apollo and a member of the European Principal Finance Fund team focusing on distressed real estate and corporate special situations. Before being an investment professional, he was an analyst at the restructuring boutique Houlihan Lokey and at the M&A advisory desk of JP Morgan for over three years.Andrea received his Msc in Energy Trade and Finance at Cass Business School in London and a BA from Bocconi University Milan. Andrea is fluent in Italian, English and German.",
        "img": "../../assets/img/team/Rumignani, Andrea.jpg"
    },
    {
        "id": 9,
        "heading": "Ash Phakey",
        "role":"Associate",
        "detail": "Ash joined Intriva in September 2020. Prior to joining, Ash worked for two years as a Manager at British American Tobacco in their M&A department. Before this, he was an Associate Director with a specialty in Financial Modelling at Grant Thorton UK LLP for seven years.Ash received his MA Mathematics the University of Cambridge. Ash is fluent in English, Spanish and German.",
        "img": "../../assets/img/team/Phakey, Ash.jpg"
    },
    {
        "id": 10,
        "heading": "Jürgen Hobrecker",
        "role":"Senior Asset Manager",
        "detail": "Jürgen Hobrecker is Intriva’s Head of Investment Management and has over 16 years’ experience in alternative fund management operations and analytics. He joined the European Lone Star team in 2004 to build and develop Hudson Advisors Germany, their captive loan and real estate asset management platform. In 2007 he joined Apollo Global Management to build and develop their European Principal Finance funds as well as Lapithus Management, their European servicing platform. In these roles at two of the largest global firms in this sector he worked directly with Intriva’s Founding Partners. Before moving to the finance industry Jürgen worked as database developer and analyst at a software firm in Munich and was responsible for key projects for BMW and the Munich Reinsurance corporation.Jürgen received his Architecture degree from the Universidad de los Andes, Bogotá in 1993. Jürgen is fluent in Spanish, English and German.",
        "img": "../../assets/img/team/Hobrecker, Jürgen.jpg"
    },
    {
        "id": 11,
        "heading": "Luis Dominguez Cortés",
        "role":"Senior Asset Manager",
        "detail": "Luis is Intriva’s Senior Asset Manager for Spain and Portugal based between Madrid and London. Luis assists in the underwriting and closing process, engages and negotiates with third party service providers, takes the leadership role in the management of projects, provides detailed updates on asset investments. Before joining Intriva Luis worked for Ayco Grupo Inmobiliario since 2015 as a Business Development Director. AYCO is a publicly listed real estate company on the Madrid stock exchange with a long and successful history of development projects in the Spanish market. At Ayco, Luis was responsible for identifying and analysing real estate assets and investment opportunities in local markets, carrying out due diligence processes, repositioning, developing and managing acquired assets, coordinating multidisciplinary work teams. He was the investment committee secretary since September 2017 and board member and audit committee member since June 2018. Luis first worked on several engineering and property development projects in Southern Spain. such as the South Padre Island Golf Club (Texas), the Apes Hill Club (Barbados) and the Carvel Property (New York), Marina de Cope (Murcia) and Arcos Gardens (Cádiz) among others.Luis received his Bachelor’s degree in Agricultural Technical Engineering from the University of Cordoba in 2004 and a Masters of Science in Real Estate Development from Columbia University (NY) in 2009. Luis is fluent in Spanish and English.",
        "img": "../../assets/img/team/Dominguez Cortés, Luis.jpg"
    },
    {
        "id": 12,
        "heading": "Sameera Irfan",
        "role":"Senior Investment Controller",
        "detail": "Sameera joined Intriva in October 2019 as a Senior Investment Controller to assist the post-acquisition team with all aspects of accounting and finance. Sameera has over12 years’ experience in all aspects of fund and investment accounting and administration. Prior to joining Intriva, Sameera was a Client Services Manager at Augentius (UK) Limited, which she joined in 2017 and where she focused on the administration of multiple private equity and credit funds. During her time at Augentius, Sameera was responsible for managing a team of up to 15 qualified and part qualified Accountants. Prior to this she was at the Kuwait Investment Authority, where she was responsible for overseeing the input of cash flows related to drawdowns and distributions, allocating drawdowns between an underlying portfolio companies and overseeing the input of fund NAVs on a quarterly basis as well as performing monthly valuation checks. Sameera received a distinction in International Accounting MSc from Anglia Ruskin University. She is qualified Chartered Accountant.",
        "img": "../../assets/img/team/Irfan, Sameera.jpg"
    },
    {
        "id": 13,
        "heading": "Molly Quinn",
        "role":"Financial Controller",
        "detail": "Molly is a Financial Controller at Intriva and is responsible for supporting the team in matters relating to financial activities. Prior to joining, Molly worked for two years as a Management Accountant at SAV Group UK. Before this, she was an Accounts Assistant at Wates Group. Molly received her BA in Classics and Classical Languages, Literature and Linguistics from the University of Nottingham.",
        "img": "../../assets/img/team/Quinn, Molly.jpg"
    },
    {
        "id": 14,
        "heading": "Daniel Rosenkranz",
        "role":"Financial Controller",
        "detail": "Daniel is a Financial Controller at Intriva and is responsible for supporting the team in matters relating to financial activities. Prior to joining, Daniel worked for six years at Precitec KG, most recently as Head of Financing and Controlling. Prior to this, he was an Associate Director at Lapithus Management, a Senior Consultant at PriceWaterhouseCooper and Tax Inspector at Finanzamt Frankfurt am Main IV. ",
        "img": "../../assets/img/team/Mesch, Felix.jpg"
    },
    {
        "id": 15,
        "heading": "Cara Brazier",
        "role":"Team Assistant",
        "detail": "Cara supports the Intriva team.  Prior to joining Intriva, Cara worked at ",
        "img": "../../assets/img/team/Brazier, Cara.jpg"
    }
   
]